{"Kent State ": {"@KonnorFink Oh I’m transferring to Kent, I just genuinely didn’t know why some schools had State in their name": "Mon Oct 30 00:03:54 +0000 2017", "RT @OhioWSoccer: The No. 8 Bobcats gave the top-seeded Kent State all they could handle. And incredible effort Ohio.": "Mon Oct 30 00:03:34 +0000 2017", "RT @BarstoolIrish: We have history with Navy, that won’t  change. And may I respond with Kent State and Citadel? Not to mention the weak AC…": "Mon Oct 30 00:03:03 +0000 2017", "Hi I'm Alli, a special education student at Kent State. This is my first #21stedchat !": "Mon Oct 30 00:02:21 +0000 2017", "@Edu_Thompson @dprindle Hi! I'm Eden, studying special education at Kent State. #21stedchat": "Mon Oct 30 00:01:42 +0000 2017", "Hi! My name is Sarah. I am a Kent State Student studying Early Childhood and Special Education! #21stedchat": "Mon Oct 30 00:01:26 +0000 2017", "My name is Shannan, I am a Early Childhood Education major at Kent State University!  #21stedchat": "Mon Oct 30 00:01:04 +0000 2017", "Kent read, Kent write, Kent State @ Hungry Howie's of Kent https://t.co/XyHq0yO9lv": "Mon Oct 30 00:00:56 +0000 2017", "To whoever pulled the Kent State park sign out of the ground. Idk if I’m mad or impressed. The one behind Acme, if yur curious": "Sun Oct 29 23:59:56 +0000 2017", "RT @TekeJones23: First official visit tomorrow to Kent state!!! #GoFlashes": "Sun Oct 29 23:56:21 +0000 2017", "RT @BallStateSoccer: Cardinals will head to Kent, Ohio, for Friday's semifinal matchup with Toledo. The other semifinal features Kent State…": "Sun Oct 29 23:54:59 +0000 2017", "Kent read, Kent write, can’t park at Kent State without getting my car towed in the middle of… https://t.co/MDeOrJEwC7": "Sun Oct 29 23:54:01 +0000 2017", "The U.S. could be in a national state of emergency but there would still be a line at the Kent Chipotle": "Sun Oct 29 23:49:14 +0000 2017", "Hey Kent State Family and Community!\n\nIf you’re looking for an evening of great talent AND want to support the Kent… https://t.co/pwVtVynIY6": "Sun Oct 29 23:47:51 +0000 2017", "First official visit tomorrow to Kent state!!! #GoFlashes": "Sun Oct 29 23:44:43 +0000 2017"}}